In [5]:
import pandas as pd

In [11]:
com = pd.DataFrame([[869,374,569,197], 
                   [578,286,427,89],
                   [321,148,335,66]],
                  index=['서울지점','부산지점','제주지점'],
                  columns=[ '컴퓨터','모니터', '노트북', '스마트폰']) 
display(com) #display 출력을 할려면 ['index']  형태로 입력해야 DataFrame 형태로 출력가능
print(com)

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [13]:
com.loc['서울지점']

컴퓨터     869
모니터     374
노트북     569
스마트폰    197
Name: 서울지점, dtype: int64

In [8]:
com.loc[['서울지점']] # display 형태로 출력할려면 ['index']

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197

In [14]:
com.iloc[1]

컴퓨터     578
모니터     286
노트북     427
스마트폰     89
Name: 부산지점, dtype: int64

In [10]:
com.iloc[1:2] #display 형태로 출력할려면 : 범위지정해서 해줘야

      컴퓨터  모니터  노트북  스마트폰
부산지점  578  286  427    89

In [27]:
com2={'지점명':['서울지점','제주지점'],'컴퓨터':[869,321],'모니터':[374,148],'노트북':[569,335]}
c=pd.DataFrame(com2)
c

    지점명  컴퓨터  모니터  노트북
0  서울지점  869  374  569
1  제주지점  321  148  335

In [28]:
c.set_index('지점명',inplace=True)
c

      컴퓨터  모니터  노트북
지점명
서울지점  869  374  569
제주지점  321  148  335

In [29]:
c['스마트폰']=0
c

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569     0
제주지점  321  148  335     0

In [30]:
c.loc['서울지점','스마트폰']=197
c.iloc[1,3]=66
c

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
제주지점  321  148  335    66